
## Plan Result




<pre><code>Plan: 10 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.apim_subscription_powerplatform_primary_key[0]
  * azurerm_key_vault_secret.apim_subscription_powerplatform_secondary_key[0]
  * azurerm_key_vault_secret.apim_subscription_smoketest_primary_key[0]
  * azurerm_key_vault_secret.apim_subscription_smoketest_secondary_key[0]
  * module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription
  * module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription
  * module.pre-api-mgmt-api-policy[0].azurerm_api_management_api_policy.api_policy
  * module.pre_api[0].azurerm_api_management_api.api
  * module.pre_api[0].azurerm_api_management_product_api.link_to_product[0]
  * module.pre_product[0].azurerm_api_management_product.product


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.apim_subscription_powerplatform_primary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_powerplatform_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg"
      + name                    = "apim-sub-powerplatform-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.apim_subscription_powerplatform_secondary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_powerplatform_secondary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg"
      + name                    = "apim-sub-powerplatform-secondary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.apim_subscription_smoketest_primary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_smoketest_primary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg"
      + name                    = "apim-sub-smoketest-primary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.apim_subscription_smoketest_secondary_key[0] will be created
  + resource "azurerm_key_vault_secret" "apim_subscription_smoketest_secondary_key" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pre-stg/providers/Microsoft.KeyVault/vaults/pre-hmctskv-stg"
      + name                    = "apim-sub-smoketest-secondary-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.apim_subscription_powerplatform[0].azurerm_api_management_subscription.subscription will be created
  + resource "azurerm_api_management_subscription" "subscription" {
      + allow_tracing       = true
      + api_management_name = "sds-api-mgmt-stg"
      + display_name        = "PRE Power Platform subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + resource_group_name = "ss-stg-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # module.apim_subscription_smoketest[0].azurerm_api_management_subscription.subscription will be created
  + resource "azurerm_api_management_subscription" "subscription" {
      + allow_tracing       = true
      + api_management_name = "sds-api-mgmt-stg"
      + display_name        = "pre-api smoke test subscription"
      + id                  = (known after apply)
      + primary_key         = (sensitive value)
      + resource_group_name = "ss-stg-network-rg"
      + secondary_key       = (sensitive value)
      + state               = "active"
      + subscription_id     = (known after apply)
    }

  # module.pre-api-mgmt-api-policy[0].azurerm_api_management_api_policy.api_policy will be created
  + resource "azurerm_api_management_api_policy" "api_policy" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + resource_group_name = "ss-stg-network-rg"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service base-url="https://pre-api.staging.platform.hmcts.net" />
                    <cors allow-credentials="false">
                        <allowed-origins>
                            <origin>*</origin>
                        </allowed-origins>
                        <allowed-methods>
                            <method>*</method>
                        </allowed-methods>
                        <allowed-headers>
                            <header>*</header>
                        </allowed-headers>
                    </cors>
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.pre_api[0].azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "sds-api-mgmt-stg"
      + api_type              = "http"
      + display_name          = "Pre Recorded Evidence API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "pre-api"
      + path                  = "pre-api"
      + protocols             = [
          + "http",
          + "https",
        ]
      + resource_group_name   = "ss-stg-network-rg"
      + revision              = "16"
      + service_url           = "https://pre-api.staging.platform.hmcts.net"
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi+json-link"
          + content_value  = "https://raw.githubusercontent.com/hmcts/cnp-api-docs/master/docs/specs/pre-api.json"
        }
    }

  # module.pre_api[0].azurerm_api_management_product_api.link_to_product[0] will be created
  + resource "azurerm_api_management_product_api" "link_to_product" {
      + api_management_name = "sds-api-mgmt-stg"
      + api_name            = "pre-api"
      + id                  = (known after apply)
      + product_id          = "pre-api"
      + resource_group_name = "ss-stg-network-rg"
    }

  # module.pre_product[0].azurerm_api_management_product.product will be created
  + resource "azurerm_api_management_product" "product" {
      + api_management_name   = "sds-api-mgmt-stg"
      + approval_required     = false
      + display_name          = "pre-api"
      + id                    = (known after apply)
      + product_id            = "pre-api"
      + published             = true
      + resource_group_name   = "ss-stg-network-rg"
      + subscription_required = false
      + subscriptions_limit   = 20
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":209,"Program":"tfcmt","SHA1":"","Vars":{}} -->